---
type: FabricWireType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# FabricWireType

`Autodesk.Revit.DB.Structure.FabricWireType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefaultFabricWireType | 2015 | `public static ElementId CreateDefaultFabricWireType ( Document ADoc )` |
| Property | BendDiameter | 2016 | `public double BendDiameter { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | WireDiameter | 2013 | `public double WireDiameter { get ; set ; }` |